In [87]:
import mysql.connector

mydb = mysql.connector.connect(
    user='root',
    passwd='root',
    host='localhost',
    database='learning_sql_database'
)

print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x000001E6C36575C8>

In [96]:
mycursor = mydb.cursor()

name = 'Cars' # it doesn't work.
year = 2006

sql = f"""
SELECT Title, Director
FROM sql_lesson_1_movies
WHERE Year BETWEEN 2000 AND 2010
"""

In [101]:
import pandas as pd

sql = f"""
SELECT Title, Director
FROM sql_lesson_1_movies
WHERE year BETWEEN 2000 AND 2010
"""

pd.read_sql_query(sql,mydb)

             Title        Director
0   Monsters, Inc.     Pete Docter
1     Finding Nemo  Andrew Stanton
2  The Incredibles       Brad Bird
3             Cars   John Lasseter
4      Ratatouille       Brad Bird
5           WALL-E  Andrew Stanton
6               Up     Pete Docter

In [ ]:
sql = f"""
SELECT Title, Director
FROM sql_lesson_1_movies
WHERE year NOT BETWEEN 2000 AND 2010
"""
pd.read_sql_query(sql,mydb)

In [100]:
sql = f"""
SELECT Title, Director
FROM sql_lesson_1_movies
WHERE year NOT BETWEEN 2000 AND 2010
"""
pd.read_sql_query(sql,mydb)

          Title       Director
0  A Bug's Life  John Lasseter
1   Toy Story 2  John Lasseter

In [107]:
sql = f"""
SELECT title, director, year
FROM sql_lesson_1_movies
WHERE id BETWEEN 1 AND 5
"""
pd.read_sql_query(sql,mydb)

             title        director  year
0     A Bug's Life   John Lasseter  1998
1      Toy Story 2   John Lasseter  1999
2   Monsters, Inc.     Pete Docter  2001
3     Finding Nemo  Andrew Stanton  2003
4  The Incredibles       Brad Bird  2004